---
title: "Assign An Alias To A Column"
author: "Chris Albon"
date: 2018-06-18T11:53:49-07:00
description: "Assign an alias to a column in SQL."
type: technical_note
draft: false
---

Note: This tutorial was created in a [Jupyter Notebook](http://jupyter.org/). `%%read_sql` is a [Jupyter magic command](http://engineering.pivotal.io/post/introducing-sql-magic/) and can be ignored when not using Jupyter Notebooks.

## Preliminaries

In [1]:
# Load libraries
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists, drop_database

# Create PostgreSQL connection
engine = create_engine("postgres://localhost/notes_db")

# Load sql_magic so we can write SQL in Jupyter Notebooks
%load_ext sql_magic

# Setup SQL connection to the postgreSQL engine we created
%config SQL.conn_name = 'engine'

## Create Database

In [2]:
# If a PostgreSQL database with this name exists
if database_exists(engine.url):
    # Delete PostgreSQL database 
    drop_database(engine.url)
    # Create empty PostgreSQL database
    create_database(engine.url)
# Otherwise
else:
    # Create empty PostgreSQL database
    create_database(engine.url)

## Create Table

In [3]:
%%read_sql -d

CREATE TABLE staff ( 
    first varchar(255), 
    loc varchar(255),
    age int
);

Query started at 12:53:16 PM MST; Query executed in 0.00 m

## Populate Table With Data

In [4]:
%%read_sql -d 

INSERT INTO staff (first, loc, age) 
VALUES ('Jill', 'Miller', 30),
       ('Steve', 'Miller', 24),
       ('Sarah', 'Jackson', 25);

Query started at 12:53:16 PM MST; Query executed in 0.00 m

## Assign An Alias To A Column

In [6]:
%%read_sql

-- Select all records from two columns and assign them aliases
SELECT first AS first_name, loc AS location 
FROM staff;

Query started at 12:53:49 PM MST; Query executed in 0.00 m

  first_name location
0       Jill   Miller
1      Steve   Miller
2      Sarah  Jackson

## Using Aliased Columns

In this example, we create (inside the parentheses) assign aliases for two columns, then (outside the parentheses) refer to those aliased column names in a `WHERE` statement.

In [10]:
%%read_sql

-- Select all records from...
SELECT * FROM (
    -- Select two columns and assign aliases
    SELECT first AS first_name, loc AS location
    -- From staff table
    FROM staff
    -- Assign this result a new alias
    ) AS staff_aliased
-- Where this new table's records match a condition
WHERE location = 'Miller'

Query started at 01:00:57 PM MST; Query executed in 0.00 m

  first_name location
0       Jill   Miller
1      Steve   Miller